Dashboard/isbank/serviceRequests/KKB/request_uat_KKB_Kullandırım_Bildirim.xml

<!-- #endpoint#http://eacrossproductservicesuat.gm.isbank.com.tr/loan-fx-notification-web-v1/LoanFxNotificationServiceV1#endpoint# -->
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:v1="http://isbank.com/OpSvcs/ProdSpecificOperations/Loan/LoanFxNotification/Service/V1">
	<soapenv:Header>
		<wsse:Security soapenv:mustUnderstand="1" xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd">
			<wsse:BinarySecurityToken wsu:Id="SecurityToken-e280294f-20fa-4486-873d-eec5c6007a52" EncodingType="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-soap-message-security-1.0#Base64Binary" ValueType="wsst:LTPA" xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd" xmlns:wsst="http://www.ibm.com/websphere/appserver/tokentype/5.0.2">LtpaToken</wsse:BinarySecurityToken>
		</wsse:Security>
		<p:consumerContext xsi:type="p:BranchContextType" xmlns:p="http://isbank.com/Technical/EA/Header/Schema/V1" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
			<lang>tr</lang>
			<consumerCode>ID</consumerCode>
			<channelCode>branch</channelCode>
			<customerContext>   
				<customer>
					<customerNumber>601</customerNumber>
					<citizenId>13171212356</citizenId>
					<name>SEMİHA</name>
					<surname>GÜÇASY</surname>
					<taxId>4120127573</taxId>
				</customer>
			</customerContext>
			<ipAddress>10.20.12.182</ipAddress>
			<workstationName>1095X002</workstationName>
			<organizationUnitCode>1095</organizationUnitCode>
		</p:consumerContext>
	</soapenv:Header>
	<soapenv:Body>
		<v1:NotifyDisbursement>
			<v1:customerInfo>
				<v1:customerNumber>161239618</v1:customerNumber>
				<v1:customerTaxId>2020348871</v1:customerTaxId>
				<v1:customerTitle>CANSEV ENERJİ ELEKTRİK ÜRETİM A.Ş</v1:customerTitle>
			</v1:customerInfo>
			<v1:accountKey>
				<v1:accountId>43444460</v1:accountId>
				<v1:accountNumber></v1:accountNumber>
				<v1:accountType>D</v1:accountType>
			</v1:accountKey>
			<v1:currencyCode>USD</v1:currencyCode>
			<v1:loanAmount>3.00</v1:loanAmount>
			<v1:scopeCode>200</v1:scopeCode>
		</v1:NotifyDisbursement>
	</soapenv:Body>
</soapenv:Envelope>